move diagrams from dot to mermaid
